# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

#  Пример:
# для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 

k = int(input('Введите число: '))
n1 = 0
n2 = 1
a = [1, 0, 1]
count = 1
for i in range(k-1):
    n1, n2 = n2, n2 + n1
    a.append(n2)
    if count == 0:
        a.insert(0, n2)
        count = 1
    else:
        a.insert(0, -n2)
        count = 0
    
print(a)